Articles/Others/makeBrief.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-13 週三 10:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Makefile 簡介</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Flotisable" />
</head>
<body>
<div id="content">
<h1 class="title">Makefile 簡介</h1>
<p>
有鑑於實驗室有些同學跟學弟不知道怎麼用 makefile，
因為個人覺得很好用，
所以就雞婆的想來介紹一下。
</p>
<hr />
<div id="outline-container-org33e5833" class="outline-2">
<h2 id="org33e5833">Makefile 是什麼</h2>
<div class="outline-text-2" id="text-org33e5833">
<p>
makefile 是對 make 這種程式所讀取的檔案的統稱，
常被用於程式建置( build )的自動化。
但 makefile 並不只能用在程式原始碼上，
就算是一般的檔案也沒問題。
make 程式本質上是依據 makefile 所描述的規則，
對於一個 <b>目標</b> 在 <b>什麼條件</b> 下要 <b>做什麼</b> 。
所以只要需要依據一定條件做事，
就可以利用 makefile 做自動化。
比如說，我們在寫完一份報告後，
要將報告相關的檔案壓成 zip 檔。
那麼這個 zip 檔就是我們的目標，
而條件就是報告被修改，
要做的事就是壓縮檔案。
</p>

<p>
make 程式有不同變體，
在這篇文章中，我只會介紹 <a href="https://www.gnu.org/software/make">GNU make</a> 這個我比較熟悉的 make。
至於例子，因為我比較習慣用在 c++ 專案中，
所以會以 c++ 編譯的例子為主。
</p>
</div>
</div>
<div id="outline-container-org66df008" class="outline-2">
<h2 id="org66df008">基本使用</h2>
<div class="outline-text-2" id="text-org66df008">
<p>
就像前面提過的，makefile 中主要是描述一些規則( rule )。
每個規則都是由下列三個項目所組成
</p>

<ul class="org-ul">
<li><p>
目標( target )
</p>

<p>
要被產生的檔案。
</p></li>

<li><p>
條件( prerequisite )
</p>

<p>
可以是檔案或是其他目標。
條件可以是空的。
</p></li>

<li><p>
步驟( recipe )
</p>

<p>
基本上是 shell 中的指令。
</p></li>
</ul>

<p>
其語法為
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">target</span>: prerequisite
    recipe
</pre>
</div>

<p>
這個規則所描述的是：
當 <b>目標</b> 不存在，或是當 <b>條件</b> 發生改變時，
就根據 <b>步驟</b> 來產生 <b>目標</b> 。
</p>

<p>
在 c++ 中常見的例子是一個目的檔在原始檔被修改後要重新編譯，
假設原始碼名稱為 test.cpp，
在 makefile 中可以寫成
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  g++ -c -o test.cpp
</pre>
</div>

<p>
這樣子當 test.o 不存在或是 test.cpp 被修改後，
make 就會根據所寫的步驟重新編譯出 test.o。
值得一提的是，每個步驟必須由 tab 做開頭，
不能是空白或是其他字元，一定要是 tab 才行。
雖然有辦法對這個做設定，在這不在本篇文章所涵蓋的範圍。
另外就是，步驟中所描述的指令預設會用系統的 shell 作執行，
而每一行指令會是用不同的子行程做執行( 也就是各自獨立的意思 )，
當然這也可以做設定。
</p>

<p>
如果一行中所要描述的指令太長的話，
可以用 <code>\</code> 來連接兩行作為一行，如以下例子
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  g++ -std=c++11 -O2 -c \
  -o test.cpp
</pre>
</div>

<p>
而如果想要寫一些註解的話， <code>#</code> 後到該行結束為止都會是註解
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp <span style="color: #74af68;"># </span><span style="color: #74af68;">&#36889;&#26159;&#35387;&#35299;</span>
  g++ -c -o test.cpp <span style="color: #74af68;"># </span><span style="color: #74af68;">compile test.o</span>
</pre>
</div>

<p>
當一份 makefile 裡有多條規則時，預設會只執行第一條規則。
可以藉由在參數指令目標來選擇要執行的規則。
比如我們有以下 makefile
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">program</span>: test.o
  g++ -o program test.o

<span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  g++ -c -o test.o test.cpp
</pre>
</div>

<p>
如果直接執行 make，make 會根據第一條規則看要不要產生 program。
而我們可以在參數加上 test.o 來指定說要執行第二條規則。
</p>

<div class="org-src-container">
<pre class="src src-sh">make test.o
</pre>
</div>

<p>
順帶一提，
如果一條規則的條件是另一條規則的目標的話，
則 make 會先去執行另一條規則，
再執行原本的規則。
以上面 makefile 為例，
在執行 program 這條規則前。
因為 test.o 是另一條規則的目標，
所以會先看 test.o 存不存在以及 test.cpp 有沒有被修改，
來判斷要不要重新編譯 test.o。
然後再看 test.o 有沒有修改來判斷要不要重新編譯 program。
</p>
</div>
</div>

<div id="outline-container-org68ce403" class="outline-2">
<h2 id="org68ce403">變數</h2>
<div class="outline-text-2" id="text-org68ce403">
</div>
<div id="outline-container-org8342646" class="outline-3">
<h3 id="org8342646">一般變數</h3>
<div class="outline-text-3" id="text-org8342646">
<p>
有時候我們會想要修改 makefile 的一些部份，
但這些部分在很多地方被用到，
比如說要改變編譯用的程式( gcc 改 g++ 之類的 )。
或是想要重複使用同樣的指令片段，
比如說編譯 c++ 原始碼的參數都一樣。
這時候就可以使用變數。
在設定變數時常用有兩種方式，
利用 <code>=</code> 或 <code>:=</code> 。
這兩種方式的差別在於，
用 <code>:=</code> 設定會展開變數，
而 <code>=</code> 則是變數被使用時才展開。
比如
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">flag</span>  := -std=c++11
<span style="color: #dbdb95;">flag1</span> =  ${<span style="color: #dbdb95;">flag</span>} <span style="color: #74af68;"># </span><span style="color: #74af68;">flag1 &#28858; ${</span><span style="color: #dbdb95;">flag</span><span style="color: #74af68;">}</span>
<span style="color: #dbdb95;">flag2</span> := ${<span style="color: #dbdb95;">flag</span>} <span style="color: #74af68;"># </span><span style="color: #74af68;">flag2 &#28858; -std=c++11</span>

<span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  g++ ${<span style="color: #dbdb95;">flag1</span>} -c -o test.o test.cpp <span style="color: #74af68;"># </span><span style="color: #74af68;">flag1 &#23637;&#38283;&#25104; -std=c++11</span>
</pre>
</div>

<p>
我個人習慣用 <code>:=</code> ，
主要是因為使用變數時才展開變數理論上執行速度會比較慢，
尤其是變數被大量使用時影響會比較大。
不過 <code>=</code> 應該也有適用的地方，
但我就不熟悉了。
使用變數的方式主要也有兩種方式，
一個是用 <code>$(</code> <code>)</code> 來包住變數，
一個是用 <code>${</code> <code>}</code> 來包住變數。
而這兩種方式基本上沒差。
我個人習慣用 <code>${</code> <code>}</code> ，
主要是可以跟後面介紹的函式作區別。
其實直接在變數名稱前加 <code>$</code> 就可以用使用變數了，
但如果變數名稱後面直接接著文字時會有問題。
我個人是習慣統一用一種方式。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">abc</span>       := abc
<span style="color: #dbdb95;">variable1</span> := $abcdef   <span style="color: #74af68;"># </span><span style="color: #74af68;">variable1 &#28858;&#31354;&#23383;&#20018;( &#22240;&#28858; ${</span><span style="color: #dbdb95;">abcdef</span><span style="color: #74af68;">} &#26410;&#35373;&#23450;&#65292;&#38928;&#35373;&#28858;&#31354;&#23383;&#20018; )</span>
<span style="color: #dbdb95;">variable2</span> := ${<span style="color: #dbdb95;">abc</span>}def <span style="color: #74af68;"># </span><span style="color: #74af68;">variable2 &#28858; abcdef</span>
</pre>
</div>

<p>
有時候我們會想要將在變數後面加上新的值而不想覆蓋原本的值，
這時候可以用 <code>+=</code> ，
比如
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">variable1</span> := abc
<span style="color: #dbdb95;">variable1</span> += def <span style="color: #74af68;"># </span><span style="color: #74af68;">variable1 &#28858; abc def</span>
</pre>
</div>

<p>
有些常用的變數或是環境變數習慣上會用全部大寫表示，
下面為一個使用例子
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">CXX</span>      := g++
<span style="color: #dbdb95;">CXXFLAGS</span> := -std=c++11
<span style="color: #dbdb95;">LD</span>       := g++
<span style="color: #dbdb95;">LDFLAGS</span>  :=
<span style="color: #dbdb95;">PROG</span>     := test

<span style="color: #00ede1; font-weight: bold;">${</span><span style="color: #00ede1; font-weight: bold;">PROG</span><span style="color: #00ede1; font-weight: bold;">}</span>: test.o
  ${<span style="color: #dbdb95;">LD</span>} ${<span style="color: #dbdb95;">LDFLAGS</span>} -o ${<span style="color: #dbdb95;">PROG</span>} test.o

<span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  ${<span style="color: #dbdb95;">CXX</span>} ${<span style="color: #dbdb95;">CXXFLAGS</span>} -c -o test.o test.cpp
</pre>
</div>
</div>
</div>
<div id="outline-container-org23dd9a7" class="outline-3">
<h3 id="org23dd9a7">自動變數</h3>
<div class="outline-text-3" id="text-org23dd9a7">
<p>
make 支援一些特別的變數，
這些變數會根據規則而改變。
會用的話寫 makefile 會方便些，
但並不一定要會。
這裡只介紹幾個我個人常用的自動變數( 主要是因為 c++ 專案常用 )。
</p>

<p>
比較常用的就三個，分別如下
</p>

<ul class="org-ul">
<li><p>
<code>$@</code>
</p>

<p>
這個變數會展開成規則的目標。
</p></li>

<li><p>
<code>$&lt;</code>
</p>

<p>
這個變數會展開成規則的第一個條件。
</p></li>

<li><p>
<code>$^</code>
</p>

<p>
這個變數會展開成規則的所有條件。
</p></li>
</ul>

<p>
下面直接用一個例子來使用這些變數，
假設我們的 c++ 專案有 main.cpp, Test.h, Test.cpp 三個檔案
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">CXX</span>      := g++
<span style="color: #dbdb95;">CXXFLAGS</span> := -std=c++11
<span style="color: #dbdb95;">LD</span>       := g++
<span style="color: #dbdb95;">LDFLAGS</span>  :=
<span style="color: #dbdb95;">PROG</span>     := test

<span style="color: #00ede1; font-weight: bold;">${</span><span style="color: #00ede1; font-weight: bold;">PROG</span><span style="color: #00ede1; font-weight: bold;">}</span>: main.o Test.o
  ${<span style="color: #dbdb95;">LD</span>} ${<span style="color: #dbdb95;">LDFLAGS</span>} -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">^</span> <span style="color: #74af68;"># </span><span style="color: #74af68; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span><span style="color: #74af68;"> &#28858; test, $</span><span style="color: #008b8b;">^</span><span style="color: #74af68;"> &#28858; main.o Test.o</span>

<span style="color: #00ede1; font-weight: bold;">main.o</span>: main.cpp
  ${<span style="color: #dbdb95;">CXX</span>} ${<span style="color: #dbdb95;">CXXFLAGS</span>} -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span> <span style="color: #74af68;"># </span><span style="color: #74af68; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span><span style="color: #74af68;"> &#28858; main.o, $</span><span style="color: #008b8b;">&lt;</span><span style="color: #74af68;"> &#28858; main.cpp</span>

<span style="color: #00ede1; font-weight: bold;">Test.o</span>: Test.cpp Test.h
  ${<span style="color: #dbdb95;">CXX</span>} ${<span style="color: #dbdb95;">CXXFLAGS</span>} -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span> <span style="color: #74af68;"># </span><span style="color: #74af68; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span><span style="color: #74af68;"> &#28858; Test.o, $</span><span style="color: #008b8b;">&lt;</span><span style="color: #74af68;"> &#28858; Test.cpp</span>
</pre>
</div>
</div>
</div>
</div>
