makeBrief.org
* 函式
  make 提供了一些函式方便做文字的處理，
  這裡一樣只介紹幾個常用的，
  其他需要用的時候再查詢即可。
  而函式的呼叫方式是用 =$(= =)= 將函式的名稱與參數包起來。
  以下採用 gnu make info 文件的函式格式。

  - $(subst FROM,To,TEXT)

    這個函式會將 TEXT 中的 FROM 取代成 TO。
    比如

    #+BEGIN_SRC makefile
      SRCS := main.cpp test.cpp
      OBJS := $(subst .cpp,.o,${SRCS})  # OBJS 為 main.o test.o
    #+END_SRC
    
  - $(wildcard PATTERN)

    可以使用一些 shell 常用的 wildcard 來得到檔案名稱。
    假設我們的資料夾下有 main.cpp, test.cpp

    #+BEGIN_SRC makefile
      SRCS :=$(wildcard *.cpp) # SRCS 為 main.cpp test.cpp
    #+END_SRC
    
  - $(shell COMMAND)

    用 shell 執行 COMMAND，並傳回結果。

    #+BEGIN_SRC makefile
      variable := $(shell echo abc) # variable 為 abc
    #+END_SRC
* 其他好用功能
** pattern rule
   我們可以在 makefile 中利用匹配的方式來描述一些規則，
   比如我們在編譯 c++ 原始碼時，通常會將 .cpp 編譯成 .o 檔。
   這可以用下面的 pattern rule 描述

   #+BEGIN_SRC makefile
     %.o: %.cpp
       g++ -c -o $@ $<
   #+END_SRC
   
   其中 =%= 是匹配符號，
   如果 test.o 為目標或是條件，
   那 makefile 就會自動有以下規則存在

   #+BEGIN_SRC makefile
     test.o: test.cpp
       g++ -c -o $@ $<
   #+END_SRC
   
   這在處理大量類似規則時會很方便。
** 隱式規則
   make 程式其實偷偷提供了一些常用的規則，
   如果知道的話在撰寫 makefile 時可以精簡一些。
   這些隱式規則基本上都是以 pattern rule 的方式存在。
   在 gnu make，可以用 =-p= 參數來顯示預設的隱式規則。
** 包含其他檔案
   有時候將所有的規則寫在一份 makefile 的話，
   整份 makefile 可能會勒勒登。
   我們可以將 makefile 分割，
   再用 *include* 這個關鍵字將檔案包進來。

   #+CAPTION: settings
   #+BEGIN_SRC makefile
     CXX      := g++
     CXXFLAGS := -std=c++11
     LD       := g++
     LDFLAGS  :=
     PROG     := test
   #+END_SRC

   #+CAPTION: makefile
   #+BEGIN_SRC makefile
     include settings

     ${PROG}: main.o
       ${LD} ${LDFLAGS} -o $@ $^

     main.o: main.cpp
       ${CXX} ${CXXFLAGS} -c -o $@ $<
   #+END_SRC
   
   這等同於

   #+BEGIN_SRC makefile
     CXX      := g++
     CXXFLAGS := -std=c++11
     LD       := g++
     LDFLAGS  :=
     PROG     := test

     ${PROG}: main.o
       ${LD} ${LDFLAGS} -o $@ $^

     main.o: main.cpp
       ${CXX} ${CXXFLAGS} -c -o $@ $<
   #+END_SRC
** 假目標( Phony Target )
   有些時候，我們並不想要產生目標檔案，
   比如常見的 clean 目標 ，
   這個目標純粹是方便使用並不想產生 clean 這個檔案。
   或是就算檔案存在我們仍想要更新目標檔案。
   我們可以在 makefile 中加入 =.PHONY= 關鍵字來完成這些事。

   #+BEGIN_SRC makefile
     .PHONY: clean

     clean:
       rm *.o
   #+END_SRC

   =.PHONY= 會告訴 make 那些目標是假目標，
   不會產生目標檔案，
   所以不管目標檔案存不存在都會執行步驟的部分。
   這讓我們比較容易將 make 所要做的事切割成更小部分。
   比如說我們想用 make 預設目標來做到編譯程式、產生文檔和做單元測試，
   我們可以將預設目標切成幾個小目標，其中可以用假目標做分類。

   #+BEGIN_SRC makefile
     all: program docs unit-test

     program:
     # 編譯程式

     docs:
     # 產生文檔

     unit-test:
     # 做單元測試
   #+END_SRC
   
   順帶一題，
   習慣上會用 all 作為 make 的預設目標。

** 根據目標設定變數
   很多時候我們會想要根據要產生的目標對變數做一些修改，
   比如我們想依照 release 和 debug 目標設定不一樣的 CXXFLAGS。
   可以用下面的寫法

   #+BEGIN_SRC makefile
     CXXFLAGS := -std=c++11

     release: CXXFLAGS += -DNDEBUG -O2
     release:
     # 編譯程式

     debug: CXXFLAGS += -g -Wall
     debug:
     # 編譯程式
   #+END_SRC
   
   也就是在原本寫條件的部分改成寫變數的設定。
   要注意的是這跟一般的規則要分開來寫。
