Articles/Others/makeBrief.html
<div id="outline-container-orge3bbef4" class="outline-2">
<h2 id="orge3bbef4">函式</h2>
<div class="outline-text-2" id="text-orge3bbef4">
<p>
make 提供了一些函式方便做文字的處理，
這裡一樣只介紹幾個常用的，
其他需要用的時候再查詢即可。
而函式的呼叫方式是用 <code>$(</code> <code>)</code> 將函式的名稱與參數包起來。
以下採用 gnu make info 文件的函式格式。
</p>

<ul class="org-ul">
<li><p>
$(subst FROM,To,TEXT)
</p>

<p>
這個函式會將 TEXT 中的 FROM 取代成 TO。
比如
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">SRCS</span> := main.cpp test.cpp
<span style="color: #dbdb95;">OBJS</span> := $(<span style="color: #dbdb95;">subst</span> .cpp,.o,${<span style="color: #dbdb95;">SRCS</span>})  <span style="color: #74af68;"># </span><span style="color: #74af68;">OBJS &#28858; main.o test.o</span>
</pre>
</div></li>

<li><p>
$(wildcard PATTERN)
</p>

<p>
可以使用一些 shell 常用的 wildcard 來得到檔案名稱。
假設我們的資料夾下有 main.cpp, test.cpp
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">SRCS</span> :=$(<span style="color: #dbdb95;">wildcard</span> *.cpp) <span style="color: #74af68;"># </span><span style="color: #74af68;">SRCS &#28858; main.cpp test.cpp</span>
</pre>
</div></li>

<li><p>
$(shell COMMAND)
</p>

<p>
用 shell 執行 COMMAND，並傳回結果。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">variable</span> := $(<span style="color: #dbdb95;">shell</span> echo abc) <span style="color: #74af68;"># </span><span style="color: #74af68;">variable &#28858; abc</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-org8df8322" class="outline-2">
<h2 id="org8df8322">其他好用功能</h2>
<div class="outline-text-2" id="text-org8df8322">
</div>
<div id="outline-container-org65feaeb" class="outline-3">
<h3 id="org65feaeb">pattern rule</h3>
<div class="outline-text-3" id="text-org65feaeb">
<p>
我們可以在 makefile 中利用匹配的方式來描述一些規則，
比如我們在編譯 c++ 原始碼時，通常會將 .cpp 編譯成 .o 檔。
這可以用下面的 pattern rule 描述
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">%.o</span>: %.cpp
  g++ -c -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>

<p>
其中 <code>%</code> 是匹配符號，
如果 test.o 為目標或是條件，
那 makefile 就會自動有以下規則存在
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">test.o</span>: test.cpp
  g++ -c -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>

<p>
這在處理大量類似規則時會很方便。
</p>
</div>
</div>
<div id="outline-container-orgfa6e800" class="outline-3">
<h3 id="orgfa6e800">隱式規則</h3>
<div class="outline-text-3" id="text-orgfa6e800">
<p>
make 程式其實偷偷提供了一些常用的規則，
如果知道的話在撰寫 makefile 時可以精簡一些。
這些隱式規則基本上都是以 pattern rule 的方式存在。
在 gnu make，可以用 <code>-p</code> 參數來顯示預設的隱式規則。
</p>
</div>
</div>
<div id="outline-container-orgb5ae01f" class="outline-3">
<h3 id="orgb5ae01f">包含其他檔案</h3>
<div class="outline-text-3" id="text-orgb5ae01f">
<p>
有時候將所有的規則寫在一份 makefile 的話，
整份 makefile 可能會勒勒登。
我們可以將 makefile 分割，
再用 <b>include</b> 這個關鍵字將檔案包進來。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>settings</label><pre class="src src-makefile"><span style="color: #dbdb95;">CXX</span>      := g++
<span style="color: #dbdb95;">CXXFLAGS</span> := -std=c++11
<span style="color: #dbdb95;">LD</span>       := g++
<span style="color: #dbdb95;">LDFLAGS</span>  :=
<span style="color: #dbdb95;">PROG</span>     := test
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>makefile</label><pre class="src src-makefile"><span style="color: #ffad29; font-weight: bold;">include</span> <span style="color: #dbdb95;">settings</span>

<span style="color: #00ede1; font-weight: bold;">${</span><span style="color: #00ede1; font-weight: bold;">PROG</span><span style="color: #00ede1; font-weight: bold;">}</span>: main.o
  ${<span style="color: #dbdb95;">LD</span>} ${<span style="color: #dbdb95;">LDFLAGS</span>} -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">^</span>

<span style="color: #00ede1; font-weight: bold;">main.o</span>: main.cpp
  ${<span style="color: #dbdb95;">CXX</span>} ${<span style="color: #dbdb95;">CXXFLAGS</span>} -c -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>

<p>
這等同於
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">CXX</span>      := g++
<span style="color: #dbdb95;">CXXFLAGS</span> := -std=c++11
<span style="color: #dbdb95;">LD</span>       := g++
<span style="color: #dbdb95;">LDFLAGS</span>  :=
<span style="color: #dbdb95;">PROG</span>     := test

<span style="color: #00ede1; font-weight: bold;">${</span><span style="color: #00ede1; font-weight: bold;">PROG</span><span style="color: #00ede1; font-weight: bold;">}</span>: main.o
  ${<span style="color: #dbdb95;">LD</span>} ${<span style="color: #dbdb95;">LDFLAGS</span>} -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">^</span>

<span style="color: #00ede1; font-weight: bold;">main.o</span>: main.cpp
  ${<span style="color: #dbdb95;">CXX</span>} ${<span style="color: #dbdb95;">CXXFLAGS</span>} -c -o <span style="color: #00ede1; font-weight: bold;">$</span><span style="color: #008b8b; font-weight: bold;">@</span> $<span style="color: #008b8b;">&lt;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e6f0da" class="outline-3">
<h3 id="org4e6f0da">假目標( Phony Target )</h3>
<div class="outline-text-3" id="text-org4e6f0da">
<p>
有些時候，我們並不想要產生目標檔案，
比如常見的 clean 目標 ，
這個目標純粹是方便使用並不想產生 clean 這個檔案。
或是就算檔案存在我們仍想要更新目標檔案。
我們可以在 makefile 中加入 <code>.PHONY</code> 關鍵字來完成這些事。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">.PHONY</span>: clean

<span style="color: #00ede1; font-weight: bold;">clean</span>:
  rm *.o
</pre>
</div>

<p>
<code>.PHONY</code> 會告訴 make 那些目標是假目標，
不會產生目標檔案，
所以不管目標檔案存不存在都會執行步驟的部分。
這讓我們比較容易將 make 所要做的事切割成更小部分。
比如說我們想用 make 預設目標來做到編譯程式、產生文檔和做單元測試，
我們可以將預設目標切成幾個小目標，其中可以用假目標做分類。
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #00ede1; font-weight: bold;">all</span>: program docs unit-test

<span style="color: #00ede1; font-weight: bold;">program</span>:
<span style="color: #74af68;"># </span><span style="color: #74af68;">&#32232;&#35695;&#31243;&#24335;</span>

<span style="color: #00ede1; font-weight: bold;">docs</span>:
<span style="color: #74af68;"># </span><span style="color: #74af68;">&#29986;&#29983;&#25991;&#27284;</span>

<span style="color: #00ede1; font-weight: bold;">unit-test</span>:
<span style="color: #74af68;"># </span><span style="color: #74af68;">&#20570;&#21934;&#20803;&#28204;&#35430;</span>
</pre>
</div>

<p>
順帶一題，
習慣上會用 all 作為 make 的預設目標。
</p>
</div>
</div>

<div id="outline-container-org1ea8bc5" class="outline-3">
<h3 id="org1ea8bc5">根據目標設定變數</h3>
<div class="outline-text-3" id="text-org1ea8bc5">
<p>
很多時候我們會想要根據要產生的目標對變數做一些修改，
比如我們想依照 release 和 debug 目標設定不一樣的 CXXFLAGS。
可以用下面的寫法
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #dbdb95;">CXXFLAGS</span> := -std=c++11

<span style="color: #00ede1; font-weight: bold;">release</span>: <span style="color: #dbdb95;">CXXFLAGS</span> += -DNDEBUG -O2
<span style="color: #00ede1; font-weight: bold;">release</span>:
<span style="color: #74af68;"># </span><span style="color: #74af68;">&#32232;&#35695;&#31243;&#24335;</span>

<span style="color: #00ede1; font-weight: bold;">debug</span>: <span style="color: #dbdb95;">CXXFLAGS</span> += -g -Wall
<span style="color: #00ede1; font-weight: bold;">debug</span>:
<span style="color: #74af68;"># </span><span style="color: #74af68;">&#32232;&#35695;&#31243;&#24335;</span>
</pre>
</div>

<p>
也就是在原本寫條件的部分改成寫變數的設定。
要注意的是這跟一般的規則要分開來寫。
</p>
</div>
</div>
</div>
